# Brewfile — Sean C. Johnson
# Generated from: brew bundle dump
# Run: brew bundle --file=Brewfile

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "ngrok/ngrok"

# ── Shell and Terminal ────────────────────────────────────────────────────────
brew "neovim"            # Modern vim
brew "zoxide"            # Smarter cd command
brew "wget"              # File downloader
brew "wgetpaste"         # Command-line pastebin client
brew "glances"           # System monitoring (htop alternative)
brew "ncdu"              # Interactive disk usage

# ── Development Tools ─────────────────────────────────────────────────────────
brew "git-lfs"           # Git large file storage
brew "go"                # Go programming language
brew "node"              # Node.js
brew "python@3.12"       # Python
brew "uv"                # Fast Python package manager
brew "pipx"              # Install Python CLI tools in isolated envs
brew "cmake"             # Build system
brew "cmake-docs"        # CMake documentation
brew "groff"             # Text formatting system
brew "imagemagick"       # Image processing
brew "ffmpeg"            # Media processing

# ── Security and Auditing ─────────────────────────────────────────────────────
brew "age"               # Modern encryption tool
brew "openssl@3"         # SSL/TLS toolkit
brew "gitleaks"          # Scan git repos for secrets
brew "hashcat"           # Password recovery / hash cracking
brew "mkcert"            # Local trusted dev certificates
brew "nss"               # Network security services (mkcert dependency)
brew "bfg"               # Remove sensitive data from git history

# ── Cloud and Infrastructure ──────────────────────────────────────────────────
brew "awscli"            # AWS CLI
brew "terraform", link: false  # Infrastructure as code
brew "terraform-docs"    # Generate docs from Terraform modules
brew "tflint"            # Terraform linter
brew "hugo"              # Static site generator
brew "glab"              # GitLab CLI
cask "gcloud-cli"        # Google Cloud SDK

# ── Finance ───────────────────────────────────────────────────────────────────
brew "hledger"           # Plain text accounting

# ── AI and Local LLM ──────────────────────────────────────────────────────────
brew "ollama"            # Run LLMs locally
brew "openclaw-cli"      # OpenClaw AI automation CLI
cask "claude-code"       # Claude Code CLI

# ── Blockchain ────────────────────────────────────────────────────────────────
brew "ethereum"          # Ethereum utilities
brew "kubo"              # IPFS implementation
brew "somo"              # Solidity linter

# ── Networking / Remote ───────────────────────────────────────────────────────
brew "freerdp"           # Remote Desktop Protocol client
brew "portaudio"         # Cross-platform audio I/O (VoIP deps)

# ── VS Code Extensions ────────────────────────────────────────────────────────
vscode "aaron-bond.better-comments"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "mtxr.sqltools"
vscode "nervtech.mq4"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "tamasfe.even-better-toml"
vscode "vosca.vscode-v-analyzer"
vscode "vscodevim.vim"

# ── Go binaries ───────────────────────────────────────────────────────────────
go "github.com/ethereum/go-ethereum/cmd/puppeth"
