# Brewfile — Sean C. Johnson
# Run: brew bundle --file=Brewfile

# ── Shell and Terminal ────────────────────────────────────────────────────────
brew "fish"              # Modern shell alternative
brew "neovim"            # Modern vim
brew "starship"          # Cross-shell prompt
brew "tmux"              # Terminal multiplexer
brew "zoxide"            # Smarter cd command
brew "tree"              # Directory tree listing
brew "wget"              # File downloader

# ── Development Tools ─────────────────────────────────────────────────────────
brew "git"               # Version control
brew "go"                # Go programming language
brew "node"              # Node.js
brew "python@3.12"       # Python
brew "terraform"         # Infrastructure as code
brew "cmake"             # Build system

# ── Security and Encryption ───────────────────────────────────────────────────
brew "age"               # Modern encryption tool
brew "gnupg"             # GPG suite
brew "pass"              # Password manager
brew "openssl@3"         # SSL/TLS toolkit

# ── Cloud and Infrastructure ──────────────────────────────────────────────────
brew "awscli"            # AWS CLI
brew "hugo"              # Static site generator

# ── Utilities ─────────────────────────────────────────────────────────────────
brew "ripgrep"           # Fast grep (used by telescope.nvim)
brew "fd"                # Fast find (used by telescope.nvim)
brew "ffmpeg"            # Media processing
brew "groff"             # Text formatting
brew "colordiff"         # Colored diff output

# ── VS Code ───────────────────────────────────────────────────────────────────
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
