# Taps
tap "homebrew/bundle"

# Shell and Terminal
brew "wget"              # File downloader
brew "wgetpaste"         # Command-line pastebin client

# Development Tools
brew "cmake"             # Build system
brew "cmake-docs"        # Documentation for CMake
brew "go"                # Go programming language
brew "groff"             # Text formatting system
brew "node"              # Node.js
brew "portaudio"         # Cross-platform audio I/O library

# Security and Encryption
brew "age"               # Modern encryption tool
brew "openssl@3"         # SSL/TLS toolkit

# Cloud and Infrastructure
brew "awscli"            # AWS CLI
brew "hugo"              # Static site generator
brew "ipfs", restart_service: :changed, link: false  # Peer-to-peer hypermedia protocol

# Media and Documentation
brew "ffmpeg"            # Media processing
brew "freerdp"           # Remote Desktop Protocol client

# Blockchain and Cryptocurrency
brew "ethereum"          # Ethereum utilities
brew "somo"              # Solidity linter

# VS Code Extensions
vscode "aaron-bond.better-comments"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "mtxr.sqltools"
vscode "nervtech.mq4"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "tamasfe.even-better-toml"
vscode "vosca.vscode-v-analyzer"
vscode "vscodevim.vim"
